<template>
  <div class="home">
    <layouts>
      <div slot="content" class="index">
        <div class="main">
          <div class="backgroud-img">
            <div class="backgroud-wrap">
              <p hw-animate="fadeInLeft" class="me">用户协议</p>
              <p hw-animate="fadeInLeft delay-d5s" class="word">阅读本站用户协议</p>
            </div>
          </div>
          <div class="context-wrap" hw-animate="fadeInUp">
            <p class="description">
            <pre>  一、使用规则、协议接受
欢迎来到校园兼职网。感谢浏览。本站提供包括信息浏览、发布等服务（以下称“服务”）。
无论您以任何方式使用服务，均被认为您已经阅读和接受本协议。您需要经常查看本协议，以便知晓这些修订。
如果您不同意其中的任何部分或者任何修订，您唯一的解决办法是立刻停止使用服务。
使用本网站您应在适当的栏目或地区发布信息，不要做任何不良行为，包括：
1、违反任何法律或我们的禁止性内容规则，
2、内容不实或有误导性；
3、侵犯任何第三方权利、为了增加流量而故意引导他人到某个网站或论坛；
4、传播病毒或其它任何可能损害本网或本网站用户利益或财产的技术； 对本网站的内部构造施加不合理的负荷或妨碍本网站的正常运行；
5、未经他人同意而获取或收集其信息，包括电子邮件地址等；
如果我们认为用户在制造问题或其行动违反了我们规则的内容或精神，我们可以限制或终止我们的服务、删除网站上的内容，并采取技术和法律手段使得该用户离开本网站并采取处理。
无论您以任何的方式使用本公司的服务，包括但不限于浏览网站上发布的类信息，
在使用服务之前，您必须阅读、同意并接受本用户协议和隐私权声明中所含的所有条款和条件，包括以下明示载明的及因被提及而纳入的条款和条件。
您以任何方式使用服务的行为，无论您是否已经成为本公司的注册用户，将被视为您已经阅读、同意并接受所有条款和条件。
二、版规
用户发布的信息必须合法、真实、有效，用户单独承担发布内容的责任。
为了网站的健康发展，所有本站用户都需要遵守版规。违反版规会被信息删除，或者终止帐号，屏蔽IP地址等，或法律诉讼。
三、免责
鉴于本网站仅作为用户网上发布信息的网络平台提供者，并非信息的发布者；用户明确同意使用本网站的风险由用户独自承担。服务提供是建立在免费的基础上。
本网站明确表示不提供任何类型的担保，不论是明确的或隐含的。
本网站不担保服务一定能满足用户的要求，也不担保服务不会受中断，对服务的及时性、安全性、真实性、出错发生都不作担保。
、及时、顺利地传送。
用户理解并接受下载或通过本网站产品服务取得的任何信息资料取决于用户自己，并由其承担系统受损、资料丢失以及其它任何风险。对在本站上得到的任何服务、招聘信息，都不作担保。
用户不会从本网站收到口头或书面的意见或信息，本网站也不会在这里作明确担保。
四、结束服务
用户或校园兼职网可随时根据实际情况中断服务。本站不需对任何个人或第三方负责而随时中断服务。
用户若反对任何服务条款的建议或对后来的条款修改有异议，或对本站服务不满，用户只有以下的追索权：
1、不再使用本站的服务。
2、结束用户使用本站服务的资格。
3、通告校园兼职网停止该用户的服务。
结束用户服务后，用户使用校园兼职网服务的权利马上中止。
本站保留单方面终止任何用户账户的权利。当用户的帐号被终止后，在没有获得解封以前，不允许再次申请新的帐号。
五、法律
用户和校园兼职网一致同意有关本协议以及使用本站的服务产生的争议交由仲裁解决，但是校园兼职网有权选择采取诉讼方式，并有权选择受理该诉讼的有管辖权的法院。
六、用户隐私免责声明
1、用户隐私制度　　
尊重用户个人隐私是本网站的一项基本政策。所以，本站一定不会公开、编辑或透露用户的注册资料及保存在本网各项服务中的非公开内容，
除非本站在诚信的基础上认为透露这些信息在以下几种情况是必要的： 
（1）遵守有关法律规定，包括在国家有关机关查询时，提供用户在本站网页上发布的信息内容及其发布时间、互联网地址或者域名。 
（2）遵从本网站产品服务程序。 
（3）在紧急情况下竭力维护用户个人和社会大众的隐私安全。 
（4）本网站认为必要的其他情况下。 
2、用户的帐号、密码和安全性　　
您一旦注册成功成为用户，您将得到一个密码和帐号。如果您未保管好自己的帐号和密码而对您、本网站或第三方造成的损害，您将负全部责任。
另外，每个用户都要对其帐户中的所有活动和事件负全责。您可随时改变您的密码。
用户同意若发现任何非法使用用户帐号或安全漏洞的情况，立即通告本网站。
</pre>
            </p>
          </div>
        </div>
      </div>
    </layouts>
  </div>
</template>

<script>
import layouts from "@/components/layouts";
import { runAnimate } from "@/common/animate";

export default {
  name: "complaint",
  components: {
    layouts
  },
  data() {
    return {};
  },
  mounted() {
    runAnimate();
  },
  methods: {}
};
</script>
<style lang="less" scoped>
.index {
  width: 100%;
  margin: 0 auto;
  min-height: 300px;
  background-color: whitesmoke;
  .header {
    padding: 15px;
  }
  .main {
    .backgroud-img {
      height: 260px;
      background: url(../../img/banner-2.jpg) no-repeat 50%;
      color: #fff;
      background-size: cover;
      .backgroud-wrap {
        width: 80%;
        margin: 0 auto;
        .me {
          font-size: 38px;
          padding-top: 86px;
        }
        .word {
          font-size: 15px;
          padding-top: 20px;
        }
      }
    }
    .context-wrap {
      width: 80%;
      margin: 0 auto;
      padding-top: 80px;
      min-height: 600px;
      .description {
        font-size: 15px;
        color: #000;
        padding-bottom: 30px;
      }
    }
  }
}
</style>
